IDENTIFICATION DIVISION.
PROGRAM-ID. testInput.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 inputNum PIC 9(5).

PROCEDURE DIVISION.
    DISPLAY "请输入数字:"
    ACCEPT inputNum
    DISPLAY "读到数字: " inputNum
    DISPLAY "END"
    STOP RUN.
